Autodesk.Revit.DB.DividedSurface.CanBeIntersectionElement(Autodesk.Revit.DB.ElementId)
Checks if the element can be an intersection reference.
Remarks:
The element must be a level, grid, reference plane,
or a curve element whose category is lines and reference lines.
id:
The element to be checked.
Returns:
True if the element can be an intersection reference., false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.DividedSurface.RemoveAllIntersectionElements
Removes all the intersection elements from a divided surface.
Since:
2011

Autodesk.Revit.DB.DividedSurface.RemoveIntersectionElement(Autodesk.Revit.DB.ElementId)
Removes an intersection element from a divided surface.
referenceElemIdToRemove:
The intersection element to be removed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.DividedSurface.AddIntersectionElement(Autodesk.Revit.DB.ElementId)
Adds an intersection element to the divided surface.
newIntersectionElemId:
The intersection element to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element newIntersectionElemId is not a level, grid, reference plane,
or a curve element whose category is lines and reference lines.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.DividedSurface.GetAllIntersectionElements
Gets all intersection elements which produce division lines.
Returns:
The intersection elements.
Since:
2011

Autodesk.Revit.DB.DividedSurface.GetDividedSurfaceForReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Get a divided surface for a given reference.  Returns null if the reference does not host a divided surface.
document:
The document.
faceReference:
Reference that represents a face.
Returns:
The newly created divided surface.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DividedSurface.GetReferencesWithDividedSurfaces(Autodesk.Revit.DB.Element)
For a given host element get references to all the faces that host a divided surface
host:
The element that hosts the divided surfaces
Returns:
References that host a divided surface
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DividedSurface.CanBeDivided(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
This returns true if the reference represents a face that can be used to create a divided surface.
document:
The document.
reference:
The reference.
Returns:
True if the reference can be used to create a divided surface, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DividedSurface.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Creates a new instance of a divided surface with a default layout.
document:
The document.
faceReference:
Reference that represents a face.
Returns:
The newly created divided surface.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The document does not allow creation of a divided surface.
-or-
Reference is unstable import element
-or-
Reference does not represent a face
-or-
Reference already hosts a divided surface
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2014

Autodesk.Revit.DB.DividedSurface.GetTileFamilyInstance(Autodesk.Revit.DB.GridNode,System.Int32)
Get a reference to a tile element
associated with a given seed node.
Returns: A FamilyInstance object. Returns null if
the ObjectType property is not a FamilySymbol.
Returns null
if the grid node is not a "seed node", or
if the tile is omitted due to boundary conditions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown if the grid node is outside of the range specified
by NumberOfUGridlines and NumberOfVGridlines,
or if tileIndex is outside the range [0, TilesPerSeedNode-1].

Autodesk.Revit.DB.DividedSurface.GetTileReference(Autodesk.Revit.DB.GridNode,System.Int32)
Get a reference to one of the tile surfaces
associated with a given seed node.
tileIndex: An integer between 0 and T-1,
where T is Autodesk.Revit.DB.TilePattern.TilesPerSeedNode.
Returns: A reference to a Face (surface). Returns null
if the grid node is not a "seed node", or
if the tile is omitted due to boundary conditions.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
Thrown if the grid node is outside of the range specified
by NumberOfUGridlines and NumberOfVGridlines,
or if tileIndex is outside the range [0, TilesPerSeedNode-1].

Autodesk.Revit.DB.DividedSurface.IsSeedNode(Autodesk.Revit.DB.GridNode)
Reports whether a grid node is a "seed node," a node
that is associated with one or more tiles.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown
when the grid node indexes are outside the range
[ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].

Autodesk.Revit.DB.DividedSurface.GetGridSegmentReference(Autodesk.Revit.DB.GridNode,Autodesk.Revit.DB.GridSegmentDirection)
Get a reference to a line segment connecting
two adjacent grid nodes.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown
when the grid node indexes are outside the range
[ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ],
or when the adjacent grid node specified by
gridSegmentDirection is out of range.

Autodesk.Revit.DB.DividedSurface.GetGridNodeReference(Autodesk.Revit.DB.GridNode)
Get a reference to the geometric point
associated with a grid node.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown
when the grid node indexes are outside the range
[ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].

Autodesk.Revit.DB.DividedSurface.GetGridNodeLocation(Autodesk.Revit.DB.GridNode)
Specify whether a particular grid node is
interior to the surface, on the boundary, or outside
the boundary.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown
when the grid node indexes are outside the range
[ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].

Autodesk.Revit.DB.DividedSurface.GetGridNodeUV(Autodesk.Revit.DB.GridNode)
Get the position of a grid node in UV
coordinates in the surface.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException: Thrown
when the grid node indexes are outside the range
[ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].

Autodesk.Revit.DB.DividedSurface.NumberOfVGridlines
Get the number of V-gridlines used on the
surface.

Autodesk.Revit.DB.DividedSurface.NumberOfUGridlines
Get the number of U-gridlines used on the
surface.

Autodesk.Revit.DB.DividedSurface.IsComponentFlipped
Whether the pattern is flipped.
Remarks: This property has no effect unless a pattern
is selected (the ObjectType property is not null).
Changing this flag effectively reflects the component
through its XY-plane, which is equivalent to reflecting
it through the original surface.

Autodesk.Revit.DB.DividedSurface.IsComponentMirrored
Whether the pattern is mirror-imaged.
Remarks: This property has no effect unless a pattern
is selected (the ObjectType property is not null).
Changing this flag effectively reflects the component
through its YZ-plane.

Autodesk.Revit.DB.DividedSurface.ComponentRotation
The rotation of the pattern by a multiple
of 90 degrees.
Remarks: This property has no effect unless a pattern
is selected (the ObjectType property is not null).

Autodesk.Revit.DB.DividedSurface.VPatternIndent
The offset applied to the pattern by an
integral number of grid nodes in the V-direction.

Autodesk.Revit.DB.DividedSurface.UPatternIndent
The offset applied to the pattern by an
integral number of grid nodes in the U-direction.

Autodesk.Revit.DB.DividedSurface.BorderTile
Determines the handling of tiles that overlap the surface's
boundary.

Autodesk.Revit.DB.DividedSurface.AllGridRotation
Angle of rotation applied to the U- and V- directions together.

Autodesk.Revit.DB.DividedSurface.VSpacingRule
Access to the rule for laying out the second series of equidistant
parallel lines on the surface.

Autodesk.Revit.DB.DividedSurface.USpacingRule
Access to the rule for laying out the first series of equidistant
parallel lines on the surface.

Autodesk.Revit.DB.DividedSurface.HostReference
A reference to the divided face on the host.
Remarks: This is the same as the hostReference argument
to the NewDividedSurface method of Autodesk.Revit.Creation.FamilyItemFactory.

Autodesk.Revit.DB.DividedSurface.Host
The element whose surface has been divided.

Autodesk.Revit.DB.DividedSurface
An element that represents a mesh on the surface of another element, a family instance, an import instance or a geometry combination,
and a tile pattern built on that mesh.
Remarks:
The type of this element may be set to:
a TilePattern element,
a FamilySymbol element from a Curtain Panel family.